// ПоПацански.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"


#define подъёбку setlocale
#define чуть_чуть 7
#define так_себе 12
#define пошло_оно_всё 120
#define срака double
#define волосатая unsigned long
#define фигню фигня
#define кидай cin >> 
#define кончил }
#define начал {
#define конкретно *
#define ну )
#define в_общем (
#define кагбэ [ 
#define ХУЙ 0
#define да ] 
#define какая_то int
#define какой_то int
#define какое_то int
#define какие_то int
#define давай void
#define туды_сюды for
#define Слышь_это cout <<
#define эээ <<
#define и_ещё_больше ++
#define хуякс /
#define Подрыхнуть Sleep
#define подвинь_жопу new
#define бля endl
#define шнягу шняга
#define стал =
#define стала =
#define стало =
#define стали =
#define взад return
#define ну_если_уж if
#define убрать_нахуй delete
#define Закрой_Пасть CloseHandle
#define УЁБИЩЕ HANDLE
#define стало_похоже_на ==
#define говно NULL
#define присобачить +=
#define тогда /*WTF*/
#define Жди_Хрен_Дождёшься WaitForSingleObject
#define вантуз GetLastError
#define ХУИТА main // sic!
#define поехали CreateThread
#define въёбывай LPTHREAD_START_ROUTINE
#define почти <
#define норма 1
#define ДОХУЯ INFINITE
#include <windows.h>
#include <iostream>
#pragma warning в_общем disable: 4244 ну 
using namespace std;

какая_то фигня;
какие_то маленькое, ОГРОМНОЕ;
какие_то Ленин, ЕБАНУТОСТЬ;

давай поработай в_общем какая_то конкретно шняга ну 
 начал 
	маленькое стало шняга кагбэ ХУЙ да;
	какой_то козёл, говнистость;
	туды_сюды в_общем козёл стал норма; козёл почти фигня; козёл и_ещё_больше ну 
	 начал 
		ну_если_уж в_общем шняга кагбэ козёл да почти маленькое ну 
		 начал 
			маленькое стало шняга кагбэ козёл да;
			Ленин стал козёл;
			Подрыхнуть в_общем так_себе ну;
		 кончил 
	 кончил 
	
	Слышь_это "\n\nМинимальный элемент массива: " эээ маленькое эээ бля;
	
	ОГРОМНОЕ стало шняга кагбэ ХУЙ да;
	туды_сюды в_общем говнистость стало норма; говнистость почти фигня; говнистость и_ещё_больше ну 
	 начал 
		ну_если_уж в_общем шняга кагбэ говнистость да > ОГРОМНОЕ ну 
		 начал 
			ОГРОМНОЕ стало шняга кагбэ говнистость да;
			ЕБАНУТОСТЬ стала говнистость;
			Подрыхнуть в_общем пошло_оно_всё ну;
		 кончил кончил 
	
	Слышь_это "\n\nМаксимальный элемент массива: " эээ ОГРОМНОЕ эээ бля; кончил 
	 какая_то ХУИТА в_общем ну начал подъёбку в_общем ХУЙ, ".1251" ну;
	
	Слышь_это "\nВведите размерность массива: \n"; кидай фигню;
	какая_то конкретно шняга стал подвинь_жопу какая_то кагбэ фигня да;
	Слышь_это "\nВведите элементы массива: \n";

	туды_сюды в_общем какой_то козёл стал говно; 
	козёл почти фигня; козёл и_ещё_больше ну кидай шнягу кагбэ козёл да;
	волосатая пизда;

	УЁБИЩЕ быдло стало поехали в_общем говно, говно, в_общем въёбывай ну поработай, в_общем давай конкретно ну шняга, ХУЙ, &пизда ну;
	
	ну_если_уж в_общем быдло стало_похоже_на говно ну тогда взад вантуз в_общем ну; // Если ошибка

	// Находим среднее арифметическое
	срака посередине стало шняга кагбэ ХУЙ да;
	туды_сюды в_общем какая_то козёл стал норма; козёл почти фигня; козёл и_ещё_больше ну 
	 начал 
		посередине присобачить шнягу кагбэ козёл да;
		Подрыхнуть в_общем чуть_чуть ну;
	 кончил 
	посередине стало посередине хуякс фигня;
	Слышь_это "\n\nСреднее арифметическое элементов массива: " эээ посередине эээ бля;

	Жди_Хрен_Дождёшься в_общем быдло, ДОХУЯ ну; // Ждём, пока поток поработай закончит работу

	какая_то писька стала посередине; // Целая часть
	шняга кагбэ Ленин да стал писька; // Замена минимума
	шняга кагбэ ЕБАНУТОСТЬ да стала писька; // Замена максимума

	Слышь_это "\nМассив с заменой минимума и максимума на целую часть среднего арифметического: \n" эээ endl;
	туды_сюды в_общем какая_то какашка стала говно; какашка почти фигня; какашка и_ещё_больше ну 
		начал Слышь_это шняга кагбэ какашка да эээ " "; кончил 
	Слышь_это бля эээ бля;
	Закрой_Пасть в_общем быдло ну; // Закрываем дескриптор потока
	убрать_нахуй шнягу;
	взад ХУЙ; кончил

